"""function with parameters"""
 
def main():
    """get value"""
    print("ไข่เจียว เมนูยอดนิยมของคนทุกบ้าน เพราะเป็นเมนูที่ทำง่าย \
แสนเบสิก กินกับข้าวสวยร้อนๆ หรือน้ำพริกถ้วยเล็กๆ ก็อร่อยแล้ว! \
แต่ครั้งนี้เราจะมาแจกสูตรอาหาร ไข่เจียวฟู ที่มีเทคนิคต่างจากแบบเดิมที่เคยทำเล็กน้อย \
แต่รับรองว่าอร่อยแตกต่าง บอกเลยว่าถ้าทำตามเทคนิคที่เราบอก \
คุณจะลืมไข่เจียวแบบเดิมไปเลยละ ว่าแต่เจ้าเมนูไข่เจียวที่เราว่าจะทำอย่างไร \
ตามมาดูกันเลย! ส่วนผสม ไข่เจียวฟูนุ่ม ไข่ 2 ฟอง น้ำปลา 1/2 ช้อนชา \
พริกไทย 1/4 ช้อนชา น้ำ 1/2 ช้อนโต๊ะ วิธีทำ ไข่เจียวฟูนุ่ม 1.ตอกไข่ไก่ใส่ชามผสม \
ปรุงรสชาติด้วยน้ำปลา พริกไทย ตามด้วยน้ำเปล่า ตีให้เข้ากัน 2. ตั้งกระทะ ให้ร้อน \
ใส่น้ำมันพอประมาณ วอมกระทะด้วยไฟกลาง พอน้ำมันเริ่มร้อน ให้ใส่ไข่ลงไป \
3.ทอดได้สักพัก ค่อยๆ ขยับให้ไข่สุกทั่วกัน พอสีเริ่มออกเหลืองอ่อน ให้กลับอีกด้าน \
ทอดให้สุกเท่ากัน เป็นอันเสร็จ เทคนิคที่ทำให้ไข่เจียวฟูนุ่ม \
ใส่น้ำเปล่าผสมลงในตั้งแต่ตอนปรุง หรือจะใช้เป็นน้ำมะนาวก็ได้ \
น้ำเปล่าจะเป็นไอน้ำช่วยทำให้ไข่เจียวฟูนุ่มระหว่างทอด \
ควรใช้ไฟกลาง และไม่ต้องรอให้กระทะร้อนจัด \
เพราะถ้ากระทะร้อนจัดจะทำให้ไข่เจียวกระด้าง และสีไม่สวย")
 
main()